alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
        int usedH = maxVis * lineH;
        if (usedH < histH)
            tft.fillRect(0, usedH, SCREEN_W, histH - usedH, bg);
        return;
    }
    // Sprite alloc failed — fall through to direct TFT drawing
#endif

    tft.fillRect(0, 0, SCREEN_W, histH, bg);

    fontOn();
    tft.setTextWrap(false);
    for (int i = 0; i < maxVis && (firstIdx + i) < lineCount; i++) {
        int idx = firstIdx + i;
        uint16_t col = lineColor[idx];
        if (invertDisplay && col != COL_ERROR) {
            col = lineIsUser[idx] ? COL_USER_LIGHT : TFT_BLACK;
        }
        tft.setTextColor(col, bg);
        if (lineIsUser[idx]) {
            tft.setTextDatum(TR_DATUM);
            tft.drawString(lines[idx], SCREEN_W, i * lineH);
            tft.setTextDatum(TL_DATUM);
        } else {
            tft.drawString(lines[idx], 2, i * lineH);
        }
    }
    tft.setTextWrap(true);
    fontOff();
}

// Returns true if codepoint cp is covered by the VLW font.
static bool supportedCodepoint(uint32_t cp) {
    if (cp >= 0x0020 && cp <= 0x007E) return true;  // Printable ASCII
    if (cp >= 0x00A0 && cp <= 0x017F) return true;  // Latin-1 + Latin Extended-A
    if (cp == 0x03A9 || cp == 0x03C0) return true;  // Ω π
    if (cp == 0x2011 || cp == 0x2013 || cp == 0x2014) return true;  // dashes
    if (cp == 0x2018 || cp == 0x2019 || cp == 0x201C || cp == 0x201D) return true;  // quotes
    if (cp == 0x2022 || cp == 0x2026) return true;  // bullet, ellipsis
    if (cp >= 0x2070 && cp <= 0x207F) return true;  // superscripts
    if (cp == 0x20AC) return true;  // €
    return false;
}

void addMessage(bool isUser, bool isError, const char* text) {
    if (historyCount >= MAX_MESSAGES) {
        // Drop oldest two (user+AI pair)
        memmove(history, history + 2, (MAX_MESSAGES - 2) * sizeof(Message));
        historyCount -= 2;
    }
    history[historyCount].isUser       = isUser;
    history[historyCount].isError      = isError;
    history[historyCount].displayOnly  = false;
    strncpy(history[historyCount].text, text, 2047);
    history[historyCount].text[2047] = '\0';
    // Sanitise: pass supported UTF-8 codepoints through unchanged.
    // Strip C0 controls; normalise space-like and hyphen-like chars not in font;
    // drop zero-width/invisible chars; replace remaining unsupported sequences with '?'.
    {
        const char* s = history[historyCount].text;
        char tmp[2060];
        char* d   = tmp;
        char* end = tmp + sizeof(tmp) - 4;
        while (*s && d < end) {
            unsigned char c = (unsigned char)*s;
            if (c < 0x80) {
                // ASCII
                if (c == '\n' || (c >= 0x20 && c != 0x7F)) *d++ = (char)c;
                s++;
            } else if ((c & 0xE0) == 0xC0) {
                // 2-byte sequence
                unsigned char b2 = (unsigned char)s[1];
                if ((b2 & 0xC0) == 0x80) {
                    uint32_t cp = ((c & 0x1F) << 6) | (b2 & 0x3F);
                    if (cp == 0x00AD) {
                        /* U+00AD soft hyphen: drop silently */
                    } else if (supportedCodepoint(cp)) { *d++ = (char)c; *d++ = (char)b2; }
                    else                         *d++ = '?';
                    s += 2;
                } else { *d++ = '?'; s++; }
            } else if ((c & 0xF0) == 0xE0) {
                // 3-byte sequence
                unsigned char b2 = (unsigned char)s[1];
                unsigned char b3 = (unsigned char)s[2];
                if ((b2 & 0xC0) == 0x80 && (b3 & 0xC0) == 0x80) {
                    uint32_t cp = ((c & 0x0F) << 12) | ((b2 & 0x3F) << 6) | (b3 & 0x3F);
                    // Typographic spaces not in font → ASCII space
                    if ((cp >= 0x2000 && cp <= 0x200A) || cp == 0x202F || cp == 0x205F) {
                        *d++ = ' ';
                    // Hyphen-like chars not in font → ASCII hyphen-minus
                    } else if (cp == 0x2010 || cp == 0x2012 || cp == 0x2015 || cp == 0x2212) {
                        *d++ = '-';
                    // Zero-width / invisible: drop silently
                    } else if (cp == 0x200B || cp == 0x200C || cp == 0x200D ||
                               cp == 0x2060 || cp == 0xFEFF) {
                        /* drop */
                    } else if (supportedCodepoint(cp)) {
                        *d++ = (char)c; *d++ = (char)b2; *d++ = (char)b3;
                    } else { *d++ = '?'; }
                    s += 3;
                } else { *d++ = '?'; s++; }
            } else if ((c & 0xF8) == 0xF0) {
                // 4-byte sequence: unsupported range
                *d++ = '?'; s += 4;
            } else {
                s++;  // invalid byte: skip
            }
        }
        *d = '\0';
        strncpy(history[historyCount].text, tmp, 2047);
        history[historyCount].text[2047] = '\0';
    }
    historyCount++;
    scrollOffset = 0;   // auto-scroll to bottom
    rebuildLines();
    drawHistory();
}

// Show keyboard and let user type a password. Returns typed string in out (64 bytes).
// Uses the existing keyboard (inputBuf/inputLen/shiftOn/altOn globals).
// Tap the Send button area (input bar) to submit.
void enterPassword(const char* ssidPrompt, char* out) {
    inputBuf[0] = '\0';
    inputLen    = 0;
    moreMode    = false;
    shiftOn     = false;
    altOn       = false;
#ifndef TARGET_C3
    kbVisible   = true;
#endif

#ifdef TARGET_C3
    {
        // Use sprite rendering for all rows — fillRect is unreliable on C3 for large areas
        // (per-glyph setWindow/pushBlock SPI glitches leave stale pixels from the AP scan).
        // Reuse one line-height sprite: draw header lines, then fill blank rows to the bottom.
        int lineH = LINE_H_LARGE;
        int inputY = (HIST_H_KB_HIDE / lineH - 1) * lineH;  // y of input bar (matches drawInputBar)
        TFT_eSprite spr(&tft);
        spr.setColorDepth(16);
        if (spr.createSprite(SCREEN_W, lineH)) {
            spr.loadFont(DejaVuSansBold12pxData);
            // Line 0: "Password for:"
            spr.fillSprite(COL_BG);
            spr.setTextColor(TFT_YELLOW, COL_BG);
            spr.drawString("Password for:", 2, 0);
            spr.pushSprite(0, 0);
            // Line 1: SSID
            spr.fillSprite(COL_BG);
            spr.setTextColor(TFT_WHITE, COL_BG);
            spr.drawString(ssidPrompt, 2, 0);
            spr.pushSprite(0, lineH);
            spr.unloadFont();
            // Blank rows from line 2 down to just above the input bar
            spr.fillSprite(COL_BG);
            for (int y = 2 * lineH; y < inputY; y += lineH)
                spr.pushSprite(0, y);
            spr.deleteSprite();
        }
    }
#else
    tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
    fontOff();
    uiFontOn();
    tft.setTextColor(TFT_YELLOW, COL_BG);
    tft.drawString("Password for:", 2, 0);
    tft.setTextColor(TFT_WHITE, COL_BG);
    tft.drawString(ssidPrompt, 2, TXT_H);
    uiFontOff();
    drawKeyboard();
#endif
    drawInputBar();

    while (true) {
        InputEvent ev;
        if (!halPollInput(&ev)) { delay(10); continue; }

        switch (ev.type) {
            case INPUT_ENTER:
                strncpy(out, inputBuf, 63); out[63] = '\0';
                inputBuf[0] = '\0'; inputLen = 0;   // clear sensitive data
                return;
            case INPUT_CHAR:
                if (inputLen < 63) {
                    inputBuf[inputLen++] = ev.ch;
                    inputBuf[inputLen]   = '\0';
                    drawInputBar();
                }
                break;
            case INPUT_BACKSPACE:
                if (inputLen > 0) { inputBuf[--inputLen] = '\0'; drawInputBar(); }
                break;
            default:
                break;
        }
    }
}

