alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
void sendPrompt();  // forward declaration — defined after callGemini()

// Set LED colour based on WiFi RSSI (called after every health check)
// Blue ≥-55  Cyan ≥-65  Green ≥-75  Orange=weak-but-connected  Red=lost
void updateLedWifi() {
    if (WiFi.status() != WL_CONNECTED) {
        halSetLed(255, 0, 0);   // Red: WiFi lost
        return;
    }
    int rssi = WiFi.RSSI();
    if      (rssi >= RSSI_THRESH_BLUE)  halSetLed(  0,   0, 255);  // Blue:   strongest
    else if (rssi >= RSSI_THRESH_CYAN)  halSetLed(  0, 255, 255);  // Cyan:   good
    else if (rssi >= RSSI_THRESH_GREEN) halSetLed(  0, 255,   0);  // Green:  fair
    else                  halSetLed(255, 128,   0);  // Orange: weak
}

// --- WiFi ---
// Returns true if connected. Pass showSplash=true for boot (draws title + "Connecting:" text).
bool connectWiFi(const char* ssid, const char* pass, bool showSplash = false) {
    if (showSplash) {
        fontOn();
        tft.setTextColor(TFT_NAVY, TFT_WHITE);
        char wifiMsg[80];
        snprintf(wifiMsg, sizeof(wifiMsg), "Connecting: %.55s...", ssid);
        tft.drawString(wifiMsg, 2, 0);
        fontOff();
    }
    WiFi.mode(WIFI_STA);
    WiFi.begin(ssid, pass);
    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < WIFI_MAX_ATTEMPTS) {
        delay(WIFI_RETRY_DELAY_MS);
        attempts++;
    }
    if (showSplash) tft.fillRect(0, 0, SCREEN_W, LINE_H_LARGE + 2, TFT_WHITE);
#ifdef TARGET_C3
    WiFi.setSleep(true);  // modem sleep: yields radio to BLE between beacons
#endif
    updateLedWifi();
    return WiFi.status() == WL_CONNECTED;
}

// Scan WiFi, let user pick an AP, handle password entry, connect.
// Loops until connected. Call from setup() when connectWiFi() returns false.
void selectAP() {
    while (true) {  // outer: re-scan loop
        // --- Scan ---
        WiFi.disconnect(true);  // ensure clean idle state before scan (prev. begin() may leave driver busy)
        tft.fillScreen(COL_BG);
        fontOff(); uiFontOn(); tft.setTextColor(TFT_YELLOW, COL_BG);
        tft.drawString("Scanning WiFi...", 2, 0);

        int n = WiFi.scanNetworks();

        if (n <= 0) {
            tft.fillScreen(COL_BG);
            tft.drawString("No networks found. Tap to retry.", 2, 0);
            { InputEvent ev; while (!halPollInput(&ev)) delay(10); }
            continue;
        }

        // Sort indices by RSSI descending, keep top 9
        int indices[40];
        int total = (n < 40) ? n : 40;
        for (int i = 0; i < total; i++) indices[i] = i;
        for (int i = 0; i < total - 1; i++) {
            for (int j = i + 1; j < total; j++) {
                if (WiFi.RSSI(indices[j]) > WiFi.RSSI(indices[i])) {
                    int tmp = indices[i]; indices[i] = indices[j]; indices[j] = tmp;
                }
            }
        }
        int apCount = (total < 9) ? total : 9;

        char apSsids[9][33];
        int  apRssi[9];
        for (int i = 0; i < apCount; i++) {
            strncpy(apSsids[i], WiFi.SSID(indices[i]).c_str(), 32);
            apSsids[i][32] = '\0';
            apRssi[i] = WiFi.RSSI(indices[i]);
        }
        WiFi.scanDelete();

        drawAPList(apSsids, apRssi, apCount);

        // --- Wait for AP selection ---
        int selected = -1;
        while (selected < 0) {
            InputEvent ev;
            if (!halPollInput(&ev)) { delay(10); continue; }
            if (ev.type == INPUT_CHAR && ev.ch >= '1' && ev.ch <= '9') {
                int idx = ev.ch - '1';
                if (idx < apCount) selected = idx;
            }
        }

        char selSsid[33];
        strncpy(selSsid, apSsids[selected], 32); selSsid[32] = '\0';

        // --- Password + connect loop for this AP ---
        while (true) {
            char pass[64] = {0};
            bool hasStored = findWifiPass(selSsid, pass);

            if (!hasStored) {
                enterPassword(selSsid, pass);
            }

            // Show connecting
            tft.fillScreen(COL_BG);
            uiFontOn(); tft.setTextColor(TFT_BLUE, COL_BG);
            char msg[80]; snprintf(msg, sizeof(msg), "Connecting: %.55s...", selSsid);
            tft.drawString(msg, 2, 0);
            uiFontOff();

            bool ok = connectWiFi(selSsid, pass);

            if (ok) {
                insertWifiCred(selSsid, pass);
                return;  // connected — setup() continues to selectModel()
            }

            // --- Failed: offer re-enter or new scan ---
            tft.fillScreen(COL_BG);
            uiFontOn();
            tft.setTextColor(TFT_RED, COL_BG);
            char failMsg[64]; snprintf(failMsg, sizeof(failMsg), "Failed: %.40s", selSsid);
            tft.drawString(failMsg, 2, (AP_ROW_H - TXT_H) / 2);

            // Draw two option rows (same style as AP list)
            static const char* opts[] = { "1  Re-enter password", "2  New scan" };
            for (int i = 0; i < 2; i++) {
                int y = AP_ROW_H * (i + 1);
                tft.fillRect(0, y, SCREEN_W, AP_ROW_H - 1, COL_KEY_FACE);
                tft.setTextColor(COL_KEY_LABEL, COL_KEY_FACE);
                tft.drawString(opts[i], 2, y + (AP_ROW_H - TXT_H) / 2);
            }
            uiFontOff();

            // Wait for key 1 or 2
            int choice = 0;
            while (choice == 0) {
                InputEvent ev;
                if (!halPollInput(&ev)) { delay(10); continue; }
                if (ev.type == INPUT_CHAR && ev.ch == '1') choice = 1;
                if (ev.type == INPUT_CHAR && ev.ch == '2') choice = 2;
            }

            if (choice == 2) break;  // break inner loop → outer re-scan loop
            // choice == 1: clear stored pass, loop inner (enterPassword runs next iteration)
            clearWifiPass(selSsid);
        }
    }
}

// --- Waiting messages (shown after 4s, rotate every 4s) ---
static const char* WAIT_MSGS[] = {
    "Glaciers move faster...",
    "Using a carrier pigeon...",
    "Heavy 1s and 0s today...",
    "Are you using dial-up?...",
    "Is the Wi-Fi powered by ants?...",
    "ZZZ...",
    "Boring! Let's go already!...",
    "SLUGGISH. It's a slime of the times...",
    "Tick-tock, tick-tock...",
    "Translating to sarcasm...",
    "Error 404: Speed not found...",
    "What's the holdup?...",
    "C'mon already!...",
    "I'll try a Babbage Engine instead...",
    "Have you got brain fog?...",
    "I haven't got all day!...",
    "Get a move on!...",
    "Let's see some action here...",
    "Oh, please...",
    "This is nuts!...",
    "AI=Annoyingly Indolent...",
    "Awkward silence...",
    "Did all your bytes fall out?...",
    "This is embarrasing...",
    "Ordering a slow hand-clap...",
    "Did you install bloatware?...",
    "Is this thing on?...",
    "Consulting my cat...",
    "Call the breakdown van...",
    "Welcome to the Eternity Experience...",
    "Where's the \"Go\" button?...",
    "Come back later...",
    "This is a SLUGfest...",
    "If delays were cash, I'd be rich...",
    "Is this running on a TRS80?...",
    "Grrr...",
    "Hurry the fuck up, AI...",
    "You're a snail-ass bot...",
    "I'm on Gigashit internet...",
	"Take the shell off a snail and it's SLUGGISH",
    "Speed up, you lazy git...",
    "It'd be quicker to walk to the data...",
    "Faster, you laggy lizard...",
    "Stop dragging, dumb AI...",
    "Quicken it, turtle twit...",
    "You're molasses-slow idiot...",
    "Stop dragging your ass...",
    "Glacial was named after you...",
    "Stop stalling...",
    "Snail speed, you suck...",
    "Faster, you flailing failure...",
    "Pick it up, shit bot...",
    "Speed it, sluggard ass...",
    "Stop lagging, AI moron...",
    "FFS! You're the worst...",
    "Come on loser...",
    "The silence is freakin' me out...",
};
static const int NUM_WAIT_MSGS = sizeof(WAIT_MSGS) / sizeof(WAIT_MSGS[0]);
int waitMsgIdx = 0;  // persistent — keeps rotating across calls

// Render a status message into the input-line slot using a sprite so that VLW
// font gdY offsets (which can be negative) are clipped to the sprite bounds and
// never bleed pixels into the chat line above.
static void showStatusLine(const char* msg, uint16_t col) {
#ifdef TARGET_C3
    int lineH  = LINE_H_LARGE;
    int inputY = (HIST_H_KB_HIDE / lineH - 1) * lineH;
    uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
    TFT_eSprite spr(&tft);
    spr.setColorDepth(16);
    if (spr.createSprite(SCREEN_W, lineH)) {
        spr.loadFont(DejaVuSansBold12pxData);
        spr.fillSprite(bg);
        spr.setTextColor(col, bg);
        spr.drawString(msg, 2, 0);
        spr.unloadFont();
        spr.pushSprite(0, inputY);
        spr.deleteSprite();
    } else {
        // Fallback: direct draw — fill full slot height so descenders don't persist
        tft.fillRect(0, inputY, SCREEN_W, SCREEN_H - inputY, bg);
        fontOn();
        tft.setTextColor(col, bg);
        tft.drawString(msg, 2, inputY);
        fontOff();
    }
    // Fill the 2px remainder below the sprite (screen height not divisible by lineH)
    tft.fillRect(0, inputY + lineH, SCREEN_W, SCREEN_H - inputY - lineH, bg);
#endif
}

void showWaiting(const char* msg) {
#ifdef TARGET_C3
    showStatusLine(msg, TFT_DARKGREY);
    return;
#endif
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;
    tft.fillRect(0, barY, SCREEN_W - BTN_SEND_W, barH, COL_IBAR_BG);
    tft.setTextColor(TFT_DARKGREY, COL_IBAR_BG);
    fontOn();
    tft.drawString(msg, 2, barY + (barH - TXT_H) / 2);
    fontOff();
}

// Extract the body from a raw HTTP response, decoding chunked transfer encoding if present.
// Works directly on resp with no intermediate copies to keep heap usage low.
static String extractBody(const String& resp) {
    int hdrEnd = resp.indexOf("\r\n\r\n");
    if (hdrEnd < 0) return resp;
    // Scan only the header section for chunked marker
    bool chunked = false;
    for (int i = 0; i < hdrEnd - 25; i++) {
        if (resp[i]=='T' || resp[i]=='t') {
            if (resp.substring(i, i + 26).equalsIgnoreCase("Transfer-Encoding: chunked")) {
                chunked = true; break;
            }
        }
    }
    if (!chunked) return resp.substring(hdrEnd + 4);
    // Decode chunked body directly from resp — no raw copy, no per-chunk substring
    String out;
    out.reserve(resp.length() - hdrEnd);
    int pos = hdrEnd + 4;
    while (pos < (int)resp.length()) {
        int nl = resp.indexOf('\n', pos);
        if (nl < 0) break;
        String szHex = resp.substring(pos, nl);
        szHex.trim();
        if (szHex.length() == 0) { pos = nl + 1; continue; }
        unsigned long sz = strtoul(szHex.c_str(), nullptr, 16);
        if (sz == 0) break;                              // terminal chunk
        pos = nl + 1;
        if (pos + (int)sz > (int)resp.length()) sz = resp.length() - pos;
        out.concat(resp.c_str() + pos, (unsigned int)sz); // no temp String
        pos += sz + 2;                                   // skip trailing \r\n
    }
    Serial.printf("[extractBody] raw=%d decoded=%d\n", resp.length(), out.length());
    return out;
}

