alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
// --- Gemini API call ---
String callGemini(const char* prompt) {
    // Build URL path early (stack-only, no heap)
    char path[256];
    snprintf(path, sizeof(path),
        "/v1beta/models/%s:generateContent?key=%s",
        GEMINI_MODEL, GEMINI_API_KEY);

    // Reconnect WiFi if dropped
    if (WiFi.status() != WL_CONNECTED) {
        connectWiFi(wifiSsid[0], wifiPass[0]);
        if (WiFi.status() != WL_CONNECTED) return "ERR: WiFi not connected";
    }

    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(API_TIMEOUT_MS / 1000);   // 45s TLS timeout (pro model needs longer)

    showWaiting("Thinking...");  // re-assert just before blocking TLS handshake
    if (!client.connect(GEMINI_HOST, HTTPS_PORT)) {
        return "ERR: connect failed (check WiFi/DNS)";
    }

    // Build + send request body in an inner scope so reqDoc and body are freed
    // immediately after sending — before the response is read. This prevents
    // reqDoc (~4-8KB) and body (~1KB) from being alive simultaneously with
    // fullResp, reducing peak heap by ~5-10KB.
    {
        JsonDocument reqDoc;
        JsonObject sysInstr = reqDoc["system_instruction"].to<JsonObject>();
        JsonArray  sysParts = sysInstr["parts"].to<JsonArray>();
        JsonObject sysPart  = sysParts.add<JsonObject>();
        sysPart["text"]     = "Respond in 80 words or fewer. Plain text only: no markdown, no ** or * emphasis, no tables, no bullet symbols. Use paragraphs to separate distinct ideas. Never include URLs or hyperlinks. When quoting current or time-sensitive information, use your search tool to check live sources first.";

        JsonArray contents = reqDoc["contents"].to<JsonArray>();
        for (int i = 0; i < historyCount - 1; i++) {
            if (history[i].displayOnly) continue;
            JsonObject msg  = contents.add<JsonObject>();
            msg["role"]     = history[i].isUser ? "user" : "model";
            JsonArray parts = msg["parts"].to<JsonArray>();
            JsonObject part = parts.add<JsonObject>();
            part["text"]    = history[i].text;
        }
        JsonObject curMsg  = contents.add<JsonObject>();
        curMsg["role"]     = "user";
        JsonArray curParts = curMsg["parts"].to<JsonArray>();
        JsonObject curPart = curParts.add<JsonObject>();
        curPart["text"]    = prompt;
        JsonArray tools = reqDoc["tools"].to<JsonArray>();
        tools.add<JsonObject>()["google_search"].to<JsonObject>();

        String body;
        serializeJson(reqDoc, body);
        client.printf(
            "POST %s HTTP/1.0\r\n"
            "Host: " GEMINI_HOST "\r\n"
            "Content-Type: application/json\r\n"
            "Content-Length: %d\r\n\r\n",
            path, (int)body.length());
        client.print(body);
        // reqDoc and body freed here — scope ends
    }

    // Read full response using read(buf,n) — avoids available() which can prematurely
    // process TLS close_notify and discard buffered bytes.
    String fullResp;
    uint8_t rbuf[256];
    unsigned long deadline   = millis() + API_TIMEOUT_MS;
    unsigned long nextMsgMs  = millis() + API_WAIT_FIRST_MS;
    unsigned long lastData   = millis();
    bool receivedAny = false;
    while (millis() < deadline) {
        int n = client.read(rbuf, sizeof(rbuf));
        if (n > 0) {
            lastData = millis();
            receivedAny = true;
            fullResp.concat((const char*)rbuf, n);  // append whole chunk — fewer reallocations
            continue;  // read more without delay
        }
        // n <= 0: no data right now. Never break on this alone.
        if (receivedAny && !client.connected()) break;  // server closed connection
        if (receivedAny && millis() - lastData > 1000) break;  // 1s idle = response complete
        if (!receivedAny && millis() - lastData > 15000) break;  // 15s no first byte = give up
        if (WiFi.status() != WL_CONNECTED) break;
        if (millis() >= nextMsgMs) {
            showWaiting(WAIT_MSGS[waitMsgIdx]);
            waitMsgIdx = (waitMsgIdx + 1) % NUM_WAIT_MSGS;
            nextMsgMs += 4000;
        }
#ifndef TARGET_C3
        pollKBHide();
#endif
        delay(5);
    }
    client.stop();
    Serial.printf("[Gemini] response len=%d\n", fullResp.length());

    if (fullResp.length() == 0) return "ERR: empty response";

    // Extract HTTP status code
    int httpStatus = 200;
    int statusPos = fullResp.indexOf("HTTP/");
    if (statusPos >= 0) {
        int eol = fullResp.indexOf('\n', statusPos);
        sscanf(fullResp.substring(statusPos, eol).c_str(), "HTTP/%*s %d", &httpStatus);
    }

    // HTTP/1.0 is never chunked — skip headers and find JSON start directly in fullResp,
    // avoiding the extractBody() copy that would double peak heap usage.
    int hdrEnd   = fullResp.indexOf("\r\n\r\n");
    int bodyOff  = (hdrEnd >= 0) ? hdrEnd + 4 : 0;

    // Detect truncated response via Content-Length; return ERR to trigger caller's retry.
    if (hdrEnd > 0) {
        int clPos = fullResp.indexOf("Content-Length: ");
        if (clPos > 0 && clPos < hdrEnd) {
            int contentLen = atoi(fullResp.c_str() + clPos + 16);
            int bodyGot    = (int)fullResp.length() - bodyOff;
            if (bodyGot < contentLen) {
                Serial.printf("[Gemini] truncated: %d of %d body bytes\n", bodyGot, contentLen);
                return "ERR: truncated response";
            }
        }
    }

    int jsonStart = fullResp.indexOf('{', bodyOff);
    if (jsonStart < 0) {
        char buf[40]; snprintf(buf, sizeof(buf), "ERR: HTTP %d, no JSON", httpStatus);
        return String(buf);
    }

    // Parse JSON — use filter to skip grounding metadata (can be 8KB+)
    JsonDocument filter;
    filter["candidates"][0]["content"]["parts"][0]["text"] = true;
    filter["error"]["message"] = true;
    JsonDocument respDoc;
    DeserializationError derr = deserializeJson(respDoc, fullResp.c_str() + jsonStart,
                                                DeserializationOption::Filter(filter));
    if (derr == DeserializationError::Ok || derr == DeserializationError::IncompleteInput) {
        // IncompleteInput is normal: Gemini appends large metadata after the text field;
        // SSL close_notify arrives before all of it. Text is captured before truncation.
        const char* errMsg = respDoc["error"]["message"];
        if (errMsg) {
            char buf[80]; snprintf(buf, sizeof(buf), "ERR: %.72s", errMsg);
            return String(buf);
        }

        const char* text = respDoc["candidates"][0]["content"]["parts"][0]["text"];
        if (text) return String(text);
    }

    // JSON parse failed or text field not captured — manually extract "text": "..."
    Serial.printf("[Gemini] JSON err=%s, trying manual extract\n", derr.c_str());
    const char* raw = fullResp.c_str() + jsonStart;
    const char* marker = strstr(raw, "\"text\": \"");
    if (!marker) marker = strstr(raw, "\"text\":\"");
    if (marker) {
        const char* start = strchr(marker + 6, '"') + 1;  // skip past opening quote
        String result;
        const char* p = start;
        bool closed = false;
        while (*p) {
            if (*p == '\\' && *(p+1)) { result += *p++; result += *p++; continue; }
            if (*p == '"') { closed = true; break; }
            result += *p++;
        }
        if (!closed) {
            // SSL died mid-string — text field was never closed; retry rather than show garbage
            Serial.printf("[Gemini] manual extract truncated (%d chars, no closing quote)\n", result.length());
            return "ERR: truncated response";
        }
        result.replace("\\n", "\n");
        result.replace("\\\"", "\"");
        result.replace("\\\\", "\\");
        if (result.length() > 0) {
            Serial.printf("[Gemini] manual extract OK (%d chars)\n", result.length());
            return result;
        }
    }

    Serial.println("Bad JSON (HTTP " + String(httpStatus) + "): " + fullResp.substring(jsonStart, jsonStart + 300) + " err=" + derr.c_str());
    char buf[40]; snprintf(buf, sizeof(buf), "ERR: HTTP %d, bad JSON", httpStatus);
    return String(buf);
}

// --- Grok API call (xAI /v1/responses + web_search tool) ---
String callGrok(const char* prompt) {
    if (WiFi.status() != WL_CONNECTED) {
        connectWiFi(wifiSsid[0], wifiPass[0]);
        if (WiFi.status() != WL_CONNECTED) return "ERR: WiFi not connected";
    }

    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(API_TIMEOUT_MS / 1000);

    showWaiting("Thinking...");
    if (!client.connect(GROK_HOST, HTTPS_PORT)) {
        return "ERR: connect failed (check WiFi/DNS)";
    }

    // Build + send in inner scope to free reqDoc and body before reading response
    {
        JsonDocument reqDoc;
        reqDoc["model"]        = GROK_MODEL;
        reqDoc["stream"]       = false;
        reqDoc["instructions"] = "Respond in 80 words or fewer. Plain text only: no markdown, no ** or * emphasis, no tables, no bullet symbols, no numbered or unnumbered lists. Use paragraphs to separate distinct ideas. Never include URLs, hyperlinks, citations, footnotes, source references, or attribution of any kind. Do not mention where information came from. When quoting current or time-sensitive information, use your web search tool to check live sources first.";

        JsonArray input = reqDoc["input"].to<JsonArray>();
        for (int i = 0; i < historyCount - 1; i++) {
            if (history[i].displayOnly) continue;
            JsonObject msg  = input.add<JsonObject>();
            msg["role"]     = history[i].isUser ? "user" : "assistant";
            msg["content"]  = history[i].text;
        }
        JsonObject curMsg  = input.add<JsonObject>();
        curMsg["role"]     = "user";
        curMsg["content"]  = prompt;
        JsonArray tools = reqDoc["tools"].to<JsonArray>();
        tools.add<JsonObject>()["type"] = "web_search";

        String body;
        serializeJson(reqDoc, body);
        client.printf(
            "POST /v1/responses HTTP/1.0\r\n"
            "Host: " GROK_HOST "\r\n"
            "Content-Type: application/json\r\n"
            "Authorization: Bearer %s\r\n"
            "Content-Length: %d\r\n\r\n",
            GROK_API_KEY, (int)body.length());
        client.print(body);
        // reqDoc and body freed here
    }

