alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
    String fullResp;
    uint8_t rbuf[256];
    unsigned long deadline  = millis() + API_TIMEOUT_MS;
    unsigned long nextMsgMs = millis() + API_WAIT_FIRST_MS;
    unsigned long lastData  = millis();
    bool receivedAny = false;
    while (millis() < deadline) {
        int n = client.read(rbuf, sizeof(rbuf));
        if (n > 0) {
            lastData = millis();
            receivedAny = true;
            fullResp.concat((const char*)rbuf, n);
            continue;
        }
        if (receivedAny && !client.connected()) break;
        if (receivedAny && millis() - lastData > 1000) break;
        if (!receivedAny && millis() - lastData > 15000) break;
        if (WiFi.status() != WL_CONNECTED) break;
        if (millis() >= nextMsgMs) {
            showWaiting(WAIT_MSGS[waitMsgIdx]);
            waitMsgIdx = (waitMsgIdx + 1) % NUM_WAIT_MSGS;
            nextMsgMs += 6000;
        }
#ifndef TARGET_C3
        pollKBHide();
#endif
        delay(10);
    }
    client.stop();
    Serial.printf("[Groq] response len=%d\n", fullResp.length());

    if (fullResp.length() == 0) return "ERR: empty response";

    // Parse HTTP status
    int httpStatus = 200;
    if (fullResp.startsWith("HTTP/")) {
        int sp = fullResp.indexOf(' ');
        if (sp > 0) httpStatus = fullResp.substring(sp + 1, sp + 4).toInt();
    }

    int jsonStart = fullResp.indexOf('{');
    if (jsonStart < 0) return "ERR: no JSON in response";
    Serial.println("[Groq] JSON body: " + fullResp.substring(jsonStart, jsonStart + 400));

    if (httpStatus != 200) {
        char buf[80];
        snprintf(buf, sizeof(buf), "ERR: HTTP %d (see serial)", httpStatus);
        return String(buf);
    }

    JsonDocument respDoc;
    if (deserializeJson(respDoc, fullResp.c_str() + jsonStart) != DeserializationError::Ok) {
        Serial.println("Bad JSON: " + fullResp.substring(jsonStart, jsonStart + 200));
        return "ERR: JSON parse failed";
    }

    const char* errMsg = respDoc["error"]["message"];
    if (errMsg) {
        char buf[80];
        snprintf(buf, sizeof(buf), "ERR: %.72s", errMsg);
        return String(buf);
    }

    // OpenAI-compatible: choices[0].message.content
    const char* text = respDoc["choices"][0]["message"]["content"];
    if (text) return String(text);

    return "ERR: no text in response";
}

// --- Send flow ---
void showThinking() {
#ifdef TARGET_C3
    showStatusLine("Thinking...", TFT_DARKGREY);
    return;
#endif
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;
    tft.fillRect(0, barY, SCREEN_W - BTN_SEND_W, barH, COL_IBAR_BG);
    tft.setTextColor(TFT_DARKGREY, COL_IBAR_BG);
    fontOn();
    tft.drawString("Thinking...", 2, barY + (barH - TXT_H) / 2);
    fontOff();
}

void sendPrompt() {
    char prompt[128];
    if (inputLen == 0) {
        if (historyCount == 0) return;  // no conversation yet — ignore
        strncpy(prompt, "Tell me more", 127);
    } else {
        strncpy(prompt, inputBuf, 127);
        inputBuf[0] = '\0';
        inputLen    = 0;
    }
    prompt[127] = '\0';
    moreMode = false;
#ifndef TARGET_C3
    kbVisible = false;   // hide KB; drawHistory() covers the KB area
#endif
    drawInputBar();      // clear full bar now — erases BS/Hide key remnants before API wait

    // Show user message and thinking indicator
    addMessage(true, false, prompt);
    showThinking();

    // Call API — deinit NimBLE on C3 to free ~30KB heap for TLS buffers.
    halBeforeApiCall();
    if (WiFi.status() != WL_CONNECTED) {
        WiFi.reconnect();
        for (int i = 0; i < 50 && WiFi.status() != WL_CONNECTED; i++) delay(100);
    }
    String response = useGroq ? callGroq(prompt) : (useGrok ? callGrok(prompt) : callGemini(prompt));
    // Retry once on empty response (transient WiFi disruption after NimBLE deinit on C3)
    if (response == "ERR: empty response") {
        if (WiFi.status() != WL_CONNECTED) WiFi.reconnect();
        for (int i = 0; i < 50 && WiFi.status() != WL_CONNECTED; i++) delay(100);
        response = useGroq ? callGroq(prompt) : (useGrok ? callGrok(prompt) : callGemini(prompt));
    }
    halAfterApiCall();

    if (response.startsWith("ERR:")) {
        addMessage(false, true, response.c_str());
    } else {
        addMessage(false, false, response.c_str());
    }

    moreMode = true;   // after every reply, offer "More"
    wifiHealthy = (WiFi.status() == WL_CONNECTED);  // refresh after API call; LED uses RSSI independently
    drawInputBar();
}

#ifndef TARGET_C3
void drawCrosshair(int x, int y) {
    tft.drawLine(x - 18, y, x + 18, y, TFT_WHITE);
    tft.drawLine(x, y - 18, x, y + 18, TFT_WHITE);
    tft.drawCircle(x, y, 6, TFT_WHITE);
}
#endif

void showModelChoices() {
    uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
    uiFontOn();
    tft.setTextColor(TFT_WHITE, bg);
    int optY = 2 * TXT_H + 4;  // start below the two header lines
    tft.drawString("1 Gemini 2.5 Flash", 2, optY); optY += TXT_H;
    tft.drawString("2 Gemini 3 Flash",   2, optY); optY += TXT_H;
    tft.drawString("3 Gemini 3.1 Pro",   2, optY); optY += TXT_H;
    tft.drawString("4 Grok 4.1 Fast",    2, optY); optY += TXT_H;
    tft.drawString("5 Groq OSS-120b",    2, optY); optY += TXT_H;
    if (invertDisplay) {
        tft.drawString("D Dark Theme", 2, optY); optY += TXT_H;
    }
    uiFontOff();
}

void selectModel() {
    static const char* modelIds[]    = {
        "gemini-2.5-flash",
        "gemini-3-flash-preview",
        "gemini-3.1-pro-preview"
    };
    static const bool  modelGlobal[] = { true, true, false };

    showModelChoices();

    while (true) {
        InputEvent ev;
        if (!halPollInput(&ev)) { delay(10); continue; }
        if (ev.type != INPUT_CHAR) continue;
        char ch = ev.ch;

        // Models 1–3 (Gemini)
        if (ch >= '1' && ch <= '3') {
            int i = ch - '1';
            halClickSound();
            strncpy(GEMINI_MODEL, modelIds[i], 47); GEMINI_MODEL[47] = '\0';
            geminiUseGlobal = modelGlobal[i];
            useGrok = false; useGroq = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            int clearH = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
            tft.fillRect(0, 0, SCREEN_W, clearH, bg);
            uiFontOn();
            tft.setTextColor(TFT_GREEN, bg);
            tft.drawString("Cheap AI Chat Keyboard", 2, 0);
            tft.drawString(GEMINI_MODEL, 2, LINE_H_LARGE);
            tft.setTextColor(TFT_DARKGREY, bg);
            tft.drawString("Ready.", 2, 2 * LINE_H_LARGE);
            uiFontOff();
            return;
        }
        if (ch == '4') {
            halClickSound();
            useGrok = true; useGroq = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            int clearH = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
            tft.fillRect(0, 0, SCREEN_W, clearH, bg);
            uiFontOn();
            tft.setTextColor(TFT_GREEN, bg);
            tft.drawString("Cheap AI Chat Keyboard", 2, 0);
            tft.drawString("Grok 4.1 Fast", 2, LINE_H_LARGE);
            tft.setTextColor(TFT_DARKGREY, bg);
            tft.drawString("Ready.", 2, 2 * LINE_H_LARGE);
            uiFontOff();
            return;
        }
        if (ch == '5') {
            halClickSound();
            useGroq = true; useGrok = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            int clearH = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
            tft.fillRect(0, 0, SCREEN_W, clearH, bg);
            uiFontOn();
            tft.setTextColor(TFT_GREEN, bg);
            tft.drawString("Cheap AI Chat Keyboard", 2, 0);
            tft.drawString("Groq GPT-OSS-120b", 2, LINE_H_LARGE);
            tft.setTextColor(TFT_DARKGREY, bg);
            tft.drawString("Ready.", 2, 2 * LINE_H_LARGE);
            uiFontOff();
            return;
        }
        if (ch == 'd' || ch == 'D') {
            invertDisplay = !invertDisplay;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillScreen(bg);
            drawInputBar();
            uiFontOn(); tft.setTextColor(TFT_WHITE, bg);
            tft.drawString("Cheap AI Chat Keyboard", 2, 0);
            tft.drawString("Select AI model:",       2, TXT_H + 4);
            uiFontOff();
            showModelChoices();
            continue;
        }
#ifndef TARGET_C3
        if (ch == 'c' || ch == 'C') {
            calibrateTouch();
            tft.fillScreen(COL_BG);
            uiFontOn(); tft.setTextColor(TFT_DARKGREY, COL_BG);
            tft.drawString("Cheap AI Chat Keyboard", 2, 0);
            tft.drawString("Select AI model:",       2, TXT_H);
            uiFontOff();
            drawKeyboard();
            drawInputBar(); showModelChoices();
            continue;
        }
#endif
    }
}

void setup() {
    loadWifiCreds();   // load NVS; shows AP picker on first boot if no credentials stored

#ifndef TARGET_C3
    // Hold BOOT button (GPIO0) on power-on to wipe touch calibration back to defaults
    pinMode(0, INPUT_PULLUP);
    if (digitalRead(0) == LOW) {
        Preferences p;
        p.begin("touch", false);
        p.remove("valid");
        p.remove("orient");
        p.end();
        Serial.begin(115200);
        Serial.println("[Cal] Reset to defaults via BOOT button");
        delay(500);
    }
#endif
    Serial.begin(115200);
#ifndef TARGET_C3
    Serial.println("[Cal] Loaded touch calibration from NVS");
#endif
    waitMsgIdx = random(NUM_WAIT_MSGS);
    // Display (init before backlight to avoid white flash)
    tft.init();
#ifdef TARGET_C3
    // ST7789 GRAM is 240col x 320row (portrait-native). Pre-fill all GRAM in
    // rotation 0 (CASET 0..239, RASET 0..319 both valid) so that GRAM rows
    // 240..319 contain COL_BG rather than power-on white. Without this, those
    // rows map to a visible white strip in some landscape rotations.
    tft.setRotation(0);
    tft.fillScreen(COL_BG);  // writes all 240x320 GRAM cells
    tft.setRotation(1);      // MX|MV landscape: correct physical orientation
    Serial.printf("[TFT] width=%d height=%d (expect %dx%d)\n", tft.width(), tft.height(), SCREEN_W, SCREEN_H);
#else
    #ifdef ROTATE_180
        tft.setRotation(3);
    #else
        tft.setRotation(1);
    #endif
#endif
    tft.fillScreen(COL_BG);

